question_about_mbti = {
	'T' : {
		'1' : {
			'Ti' : "새 프로젝트를 시작하기를 좋아합니다. 여러분은 설계자처럼 모든 가능성을 탐구하여 최상의 접근 방식을 찾아 솔루션을 구축합니다.",
			'Te' : "프로젝트를 완료하는 것을 좋아합니다. 100%에서 최상의 솔루션을 찾는 것보다 작업을 마무리하는 것이 좋습니다. 위기 발생 시 당신은 팀을 끝까지 밀어주는 사령관입니다." 
		},
		'2' : {
			'Ti' : "당신은 생각을 정리하여 나중에 발전시키고, 일이 어떻게 진행되는지 이해하기를 좋아합니다.",
			'Te' : "당신은 일정 수립, 정량화 및 비상 계획을 잘 수행할 수 있습니다." 
		},
		'3' : {
			'Ti' : "당신은 사물의 차이를 파악하고 논리적으로 순위를 매기는 것을 좋아합니다.",
			'Te' : "당신은 통제권을 원하고 사람들이 당신에게 영향을 미치려 하는 것을 좋아하지 않습니다." 
		},
		'4' : {
			'Ti' : "당신은 그 자체로 지식에 대한 열정을 갖고 있습니다. 정확성은 중요하며, 아이디어가 어디에서 나오든 가장 좋은 아이디어라면 그 정확성이 중요합니다.",
			'Te' : "최상의 아이디어는 효과적이며 즉시 유용합니다. 정보는 객관적이고 질서정연하며 합리적이어야 합니다." 
		},
		'5' : {
			'Ti' : "당신은 우리의 결론에 도달할 수 있는 모든 단계를 따를 수 있다는 것을 기쁘게 생각합니다. 의미는 단순한 사실보다 더 중요하며, 당신은 무대 뒤에서 일어나는 일을 이해하고 싶어합니다.",
			'Te' : "당신은 단지 효과적으로 작동하는 무언가를 원한다. 당신은 결과를 이끌어온 모든 반성의 단계와 과정을 이해하는 것보다 최종 결과에 더 관심을 갖고 있습니다. 사실들은 완전하다; 더 넓은 결론을 이끌어낼 필요가 없다." 
		},
		'6' : {
			'Ti' : "사용자에게 개념을 이해하는 것이 응용 프로그램보다 더 중요합니다.",
			'Te' : "당신에게 솔루션의 효과는 일이 일어난 방식보다 더 중요합니다." 
		},
		'7' : {
			'Ti' : "당신은 자연적으로 연역적인 것입니다. 당신은 이론을 개발한 다음 사실로 이동합니다. 합리적인 것을 바탕으로 가정하고 있습니다.",
			'Te' : "당신은 본질적으로 유도성이다. 당신은 사실에 입각한 것을 결정하고 이를 바탕으로 이론을 개발합니다. 당신은 외부로부터 제시된 객관적인 사실을 바탕으로 결정을 내립니다." 
		},
		'8' : {
			'Ti' : "당신은 상황을 복잡하게 만들 가능성이 더 높습니다.",
			'Te' : "작업을 단순화할 가능성이 높습니다." 
		},
		'9' : {
			'Ti' : "당신은 아마도 규율에 문제가 있을 것입니다.",
			'Te' : "당신은 무언가를 성취하기 위한 노력을 매우 잘 다듬는 경향이 있습니다." 
		},
		'10' : {
			'Ti' : "무슨 일이 일어났는지 중요하지만, 그것이 다시 일어날지 의미하지는 않습니다",
			'Te' : "우리는 결정을 내리기 위해 일어난 일에 의존해야 합니다" 
		},
	},
	'F' : {
		'1' : {
			'Fi' : "자신의 내부 가치를 통해 상황을 필터링하여 자신의 기분을 확인합니다. 당신은 다른 사람들에게 설명하기가 어려울 수 있는 매우 개인적이거나 직감에 기반한 윤리 시스템을 가지고 있습니다.",
			'Fe' : "가치는 객관적이고 공유됩니다. 당신은 도덕에 대한 사회적 규범과 기대(예절 등)에 의존합니다." 
		},
		'2' : {
			'Fi' : "진정성과 성실성은 당신에게 중요하며, 당신은 다른 사람들이 거짓이거나 불성실한 것처럼 보이기를 싫어합니다. 당신은 자신의 개인적인 감정을 공유하는 것을 더 꺼려합니다.",
			'Fe' : "당신은 다른 사람의 감정에 책임감을 느끼고 그들이 편안하게 느끼도록 행동을 조정합니다. 당신은 자신에게 매우 열린 경향이 있습니다." 
		},
		'3' : {
			'Fi' : "그룹에서 느끼는 감정적 괴정은 당신의 감정에 대한 외부의 감정적 지원을 필요로 하거나 원하지 않기 때문에 당신을 불편하게 만듭니다.",
			'Fe' : "당신은 상충하는 의견을 협상하고 공통의 관점을 찾아 그룹의 조화를 유지하려고 노력합니다." 
		},
		'4' : {
			'Fi' : "당신은 다른 모든 사람이 볼 수 있는 객관적인 사실보다는 상황에 대한 느낌을 통해 상황을 더 잘 해석합니다.",
			'Fe' : "당신은 행동의 도덕적인 함축들에 관심을 기울이고, 상황이 어떻게 되어야 하는가에 더 관심을 기울입니다." 
		},
		'5' : {
			'Fi' : "당신은 자신이 느끼는 바를 경청하고 자신의 감정을 표현하려고 노력하며 경험이나 예술을 통해 감정을 공유합니다",
			'Fe' : "당신은 다른 사람들의 감정을 경청하고 그들의 요구를 충족하려고 적극적으로 노력합니다." 
		},
		'6' : {
			'Fi' : "당신은 끊임없이 자기 검색 상태에 있는 경향이 있습니다. 당신은 자신의 내면의 자아를 이해하고 자신을 이상적인 사람으로 만들기 위해 노력합니다. 따라서 당신은 자신의 개인적인 감정을 자연스럽게 인식하고 자신과 관계를 맺는 방식으로 다른 사람들과 관계를 맺는 경향이 있습니다.",
			'Fe' : "당신은 타인의 감정적 반응에 자연스럽게 집중하는 경향이 있습니다. 당신은 이러한 반응에 민감하며 그에 따라 행동을 적응시키는 경향이 있습니다. 당신은 다른 사람을 위해 자신을 밀어붙이는 경향이 있기 때문에 이 때문에 어떤 사람들은 당신을 비방자/심리학자로 지칭할 수 있습니다." 
		},
		'7' : {
			'Fi' : "당신은 자신의 개인적인 감정을 다른 사람에게 투영하고 있습니다. 그렇다고 해서 공감이 없다는 뜻은 아닙니다",
			'Fe' : "당신은 자신의 감정에 관계없이 다른 사람들의 행동을 이해합니다." 
		},
		'8' : {
			'Fi' : "당신은 때때로 목표가 아닌 다른 사람의 감정을 상하게 할 수 있습니다. 왜냐하면 당신은 이러한 사람들과 감정을 표현했기 때문입니다.",
			'Fe' : "당신은 문제가 되는 사람의 요구와 기대치에 따라 다른 사람에게 정서적으로 적절한 방식으로 반응하는 데 타고난 능력을 보이는 경향이 있습니다." 
		},
		'9' : {
			'Fi' : "몸은 잘 안다.",
			'Fe' : "당신은 감정을 다른 사람들의 감정과 혼합합니다." 
		},
		'10' : {
			'Fi' : "당신은 다른 사람의 경험과 관련될 수 있을 때 매우 공감합니다. (공감이란 다른 사람의 감정을 우리가 직접 경험하는 것처럼 이해할 수 있는 능력을 설명하는 용어입니다. 또한 자신의 감정을 어떤 것에 투영하는 것을 의미할 수도 있습니다.)",
			'Fe' : "당신은 매우 동정적입니다. (공감이란 다른 사람의 감정을 나누는 능력을 말하며, 대부분 불운에 대해 고통을 느낀다.)" 
		},
	},
	'S' : {
		'1' : {
			'Si' : "당신은 현재 상황을 과거에 경험했던 것과 평상하다고 생각하는 것과 비교하고 대조합니다.",
			'Se' : "현재 물리적 세계에서 일어나는 일에 주의를 기울이고 있습니다. 당신은 자신의 오감을 가진 대부분의 사람들보다 더 잘 지각합니다." 
		},
		'2' : {
			'Si' : "당신은 자신의 이전 지식과 경험을 통해 새로운 정보를 주관적으로 필터링합니다.",
			'Se' : "당신은 판단력, 개인적 편견, 숨겨진 의미를 전혀 보지 않고 주변 세계의 모습을 객관적으로 볼 수 있습니다." 
		},
		'3' : {
			'Si' : "당신은 과거를 기억하고 보존하는 것을 좋아하며, 경험되고 진실된 것을 선호합니다. 당신이 소중히 여기는 것들은 일상적이고 친숙하며, 새로운 것들은 당신을 위해 시간이 걸릴 수 있습니다.",
			'Se' : "당신은 이미지, 냄새, 스타일, 트렌드, 주변 사람들의 작업 등 주변에서 일어나는 구체적인 일들을 따릅니다." 
		},
		'4' : {
			'Si' : "당신은 통증, 배고픔, 갈증과 같은 내면의 신체적 감각에 매우 주의를 기울입니다.",
			'Se' : "당신은 육체적인 아름다움과 새로운 감각을 좋아합니다. 스릴을 즐기는 사람, 패션 전문가 또는 구조자가 될 수 있습니다." 
		},
		'5' : {
			'Si' : "당신은 새로운 정보를 흡수하고 이를 과거의 행동 및 경험과 신중하게 비교하면서 자신의 일과에 관심을 기울입니다.",
			'Se' : "당신은 종종 행동을 취하기 위해 외부 세계로부터 촉진을 필요로 합니다." 
		},
		'6' : {
			'Si' : "관찰한다.",
			'Se' : "반응하고 있습니다." 
		},
		'7' : {
			'Si' : "당신은 과거의 실수로부터 배웁니다",
			'Se' : "당신은 과거의 영향을 잊어버리는 경향이 있습니다." 
		},
		'8' : {
			'Si' : "행동하기 전에 생각합니다.",
			'Se' : "당신은 생각보다 먼저 행동합니다." 
		},
		'9' : {
			'Si' : "당신은 장기적인 만족을 원합니다.",
			'Se' : "당신은 단기간 내에 만족감을 느끼는 것을 선호합니다. 카르페 디엠." 
		},
		'10' : {
			'Si' : "당신은 보다 온건한 사람들인 경향이 있어 장기적으로 안정적인 라이프스타일을 유지할 수 있습니다. 예를 들어 쇼핑을 즐길 수도 있지만 돈에 조심하는 경향이 있습니다.",
			'Se' : "당신은 자신을 마음껏 즐기고 충동적으로 행동하기를 원합니다. 당신은 어떤 것을 원할 때 스스로에게 '노'라고 말하거나, 매순간 인생을 가득 채워야 하기 때문에 육체적인 자극이나 쾌락을 박탈하는 것이 어려울 것입니다. 분명히, 당신이 나이가 더 많거나 더 성숙하면 당신은 더 온건하다." 
		},
	},
	'N' : {
		'1' : {
			'Ni' : "당신은 몇 가지 좋은 아이디어에 집중하고 방해 요소를 피하기 위해 다른 사람을 배제합니다.",
			'Ne' : "결정하지 않았습니다. 당신은 머릿속에서 브레인스토밍과 많은 생각을 한꺼번에 처리하는 것을 좋아합니다." 
		},
		'2' : {
			'Ni' : "당신은 목표나 꿈에 집중하고 미래를 현실로 만들 아이디어를 찾고 있습니다.",
			'Ne' : "당신은 외부세계로부터 새로운 사실을 흡수하고 새로운 아이디어를 창조하기 위해 창의적인 방식으로 점을 연결합니다." 
		},
		'3' : {
			'Ni' : "대신, 무의식적으로 뇌를 치료하고 있는 것 같은 느낌이 들 때, 갑자기 방아쇠를 당길 수 있는 순간에 도달하여 행동을 취하려는 경향이 있다.",
			'Ne' : "당신의 세계는 아이디어의 폭발로 인해, 당신은 의식적으로 사물을 구성 요소로 분해하고, 단어 뒤에 있는 아이디어의 의미를 확인하고, 다른 사람들은 그렇지 않은 관계를 만듭니다." 
		},
		'4' : {
			'Ni' : "당신은 더 적은 주제를 더 깊이 파고들어 여러 정보를 결합하여 하나의 일관된 아이디어를 냅니다.",
			'Ne' : "당신은 다양한 취미를 갖고 있으며 서로 주고받는 것을 즐깁니다. 당신은 가능성을 탐구하는 데 집중합니다." 
		},
		'5' : {
			'Ni' : "당신은 일을 할 수 있도록 선택을 하는 것을 좋아합니다. 당신은 여러 각도에서 상황을 보고 내면의 세계에 미치는 영향에 주의를 기울입니다.",
			'Ne' : "당신은 열린 마음을 가지고 있습니다. 당신은 흥미로운 정신적 영감이 부족한 상황을 싫어합니다." 
		},
		'6' : {
			'Ni' : "당신은 생각을 스스로에게 유지합니다.",
			'Ne' : "당신은 자신의 생각, 상상력을 공유하는 것을 좋아합니다." 
		},
		'7' : {
			'Ni' : "당신은 아주 작은 것에 대해 많이 알고 있다.",
			'Ne' : "당신은 많은 것에 대해 조금 알고 있습니다." 
		},
		'8' : {
			'Ni' : "당신은 자연스러운 결론을 이끌어내거나 한 가지 가능성만 보는 경향이 있습니다. 결론적으로 말하면, 주변의 정보를 매우 구체적인 방식으로 해석하는 것입니다.",
			'Ne' : '당신은 아이디어를 갖고 브레인스토밍하는 사람들입니다. 당신은 "가상" 사람들입니다. 당신은 모든 가능성으로 세상을 볼 수 있습니다. 그러면 세상을 선택하는 데 어려움이 있을 수 있으며, 이는 어떤 것에 완전히 몰입할 수 없거나 미결의 상태를 초래합니다.' 
		},
		'9' : {
			'Ni' : "당신은 협주곡, 그게 마음에 들어합니다. 추상화는 즐길 수 있는 것이 아닙니다.",
			'Ne' : "지적 추상화를 좋아합니다." 
		},
		'10' : {
			'Ni' : "당신은 한 가지 일에 집중하는 경향이 있습니다. 절대적으로 관련성 있는 내용만 공유하고자 할 것입니다. 우리는 쉽게 당신의 추론을 따를 수 있습니다",
			'Ne' : "대화를 빠르게 나눌 수 있습니다. 당신은 짧은 시간 안에 다양한 주제를 다루는 경향이 있습니다. 이상하거나 절충적으로 보일 수 있지만 추적 가능해야 하는 피사체 사이를 이동합니다." 
		},
	}
}