question_about_mbti = {
	'T' : {
		'1' : {
			'Ti' : 'Ви любите починати нові проекти. Ви як архітектор, ви будуєте своє рішення, досліджуючи всі можливості, щоб знайти найкращий підхід.',
			'Te' : 'Ви любите закінчувати проекти. Краще закінчити, ніж знайти найкраще рішення на рівні 100%. У разі кризи ви командир, який підштовхує команду до фінішу.' 
		},
		'2' : {
			'Ti' : 'Ви сортуєте ідеї у своєму розумі, щоб розвинути їх пізніше, і ви любите розуміти, як працюють речі.',
			'Te' : 'Ви добре плануєте планування, кількісно і плануєте на випадок надзвичайних ситуацій.' 
		},
		'3' : {
			'Ti' : 'Ви любите визначити, як різні речі і назвати їх логічно.',
			'Te' : 'Вам потрібен контроль, і ви не любите людей, які намагаються впливати на вас.' 
		},
		'4' : {
			'Ti' : 'Ви пристрасно володієте знаннями для себе. Точність важлива, і незалежно від того, звідки береться ідея, чи є вона найкращою.',
			'Te' : "Найкращі ідеї ефективні і відразу корисні. Інформація повинна бути об'єктивною, упорядкованною і раціональною." 
		},
		'5' : {
			'Ti' : 'Ви з нетерпінням раді слідувати кожному кроку шляху до нашого висновку. Значення важливіше, ніж чисті факти, і ви хочете зрозуміти, що відбувається за лаштунками.',
			'Te' : 'Ви просто хочете щось, що працює ефективно. Вас більше турбує кінцевий результат, ніж розуміння всіх етапів і процесів відображення, що призвели до нього. Факти досконалі; немає необхідності робити більш широкі висновки.' 
		},
		'6' : {
			'Ti' : 'Для вас розуміння поняття важливіше, ніж його застосування.',
			'Te' : 'Для вас ефективність рішення важливіша, ніж те, як відбувалося.' 
		},
		'7' : {
			'Ti' : 'Ви дедуктивні за своєю природою. Ви розробляєте теорії, а потім переходите до фактів. Ви робите припущення на основі того, що має сенс для вас.',
			'Te' : "Ви індуктивні в природі. Ви вирішуєте, що є фактичною, а потім розробляєте теорії, засновані на цьому. Ви приймаєте рішення, засновані на об'єктивних фактах, які вам пред'являються ззовні..." 
		},
		'8' : {
			'Ti' : 'Ви, швидше за все, ускладнять речі.',
			'Te' : 'Ви швидше за все спрощуватимете речі.' 
		},
		'9' : {
			'Ti' : 'У вас, мабуть, проблеми з дисципліною.',
			'Te' : 'Ви, як правило, дуже дисципліновані у своїх зусиллях, щоб досягти чогось.' 
		},
		'10' : {
			'Ti' : 'Те, що сталося, є важливим, але це не означає, що це повториться',
			'Te' : 'Ми повинні покладатися на те, що сталося, щоб приймати рішення' 
		},
	},
	'F' : {
		'1' : {
			'Fi' : 'Ви фільтруєте ситуацію через власні внутрішні цінності, щоб побачити, як ви себе почуваєте. У вас дуже особиста або заснована на кишечнику система етики, яку важко пояснити іншим.',
			'Fe' : "Цінності об'єктивні і спільні. Ви спираєтеся на соціальні норми і очікування (наприклад, етикет) для моралі." 
		},
		'2' : {
			'Fi' : 'Автентичність і щирість важливі для вас, і ви ненавидите, що інші здаються нещирими або нещирими. Ви більше не бажаєте ділитися своїми особистими почуттями.',
			'Fe' : 'Ви відчуваєте відповідальність за почуття оточуючих і адаптуєте свою поведінку, щоб зробити їх комфортними. Ви, як правило, дуже відкриті для себе.' 
		},
		'3' : {
			'Fi' : 'Емоційні сплески, що діляться групою, роблять Вас некомфортним, тому що Вам не потрібна або потрібна зовнішня емоційна підтримка Ваших почуттів.',
			'Fe' : 'Ви намагаєтеся підтримувати гармонію групи, домовляючись про суперечливі погляди і знаходячи спільну мову.' 
		},
		'4' : {
			'Fi' : "Ви інтерпретуєте ситуації більше тим, як ви відчуваєте про них, ніж об'єктивні факти, які видно всім іншим.",
			'Fe' : 'Ви звертаєте увагу на моральні наслідки дій, і ви більше дбаєте про те, як повинні бути речі, ніж як вони є.' 
		},
		'5' : {
			'Fi' : 'Ви слухаєте те, що відчуваєте, і прагнемо виразити себе і поділитися своїми емоціями через переживання або мистецтво',
			'Fe' : 'Ви слухаєте емоції інших і активно намагаєтеся задовольнити свої потреби.' 
		},
		'6' : {
			'Fi' : "Ви, як правило, в постійному стані самопошуку. Ви намагаєтеся зрозуміти своє внутрішнє Я і сформувати себе в ідеальну людину. В результаті ви, як правило, природно усвідомлюєте свої особисті почуття і будуєте відносини з іншими, з'єднуючись з собою.",
			'Fe' : 'Ви, як правило, зосереджуєтеся природно на емоційних реакціях інших. Ви чутливі до цих реакцій і схильні відповідно пристосовувати свою поведінку. Це може призвести до того, що деякі люди посилаються на вас як на дверний мат/психолога, так як ви схильні тиснути собі на край для когось іншого.' 
		},
		'7' : {
			'Fi' : 'Ви проектують свої особисті почуття на когось іншого. Це не означає, що у вас немає співпереживання',
			'Fe' : 'Ви розумієте дії інших незалежно від ваших емоцій.' 
		},
		'8' : {
			'Fi' : 'Ви іноді можете зашкодити емоціям інших навіть якщо це не ваша мета, тому що ви поклали на цей народ, ви емоції.',
			'Fe' : 'Ви, як правило, добре реагуєте на інших емоційно відповідним чином, виходячи з потреб і очікувань людини, що знаходиться під питанням.' 
		},
		'9' : {
			'Fi' : 'Ти знаєш, як ти себе почуваєш.',
			'Fe' : 'Ви змішуєте емоції з емоціями інших.' 
		},
		'10' : {
			'Fi' : 'Ви дуже емпатійні, коли можете відноситися до чужого досвіду.(співпереживання — це термін, який використовується для опису здатності розуміти почуття інших людей так, ніби ми їх самі переживають. Це також може означати проектування наших власних почуттів на щось.)',
			'Fe' : 'Ти дуже співчуваєш. (Симпатія відноситься до здатності розділяти почуття іншої людини, найчастіше відчуваючи біль за своє нещастя.)' 
		},
	},
	'S' : {
		'1' : {
			'Si' : 'Ви порівнюєте і порівнюєте свою поточну ситуацію з тим, що ви пережили в минулому і тим, що ви вважаєте нормальним.',
			'Se' : "Ви звертаєте увагу на те, що відбувається навколо Вас у фізичному світі прямо зараз. Ви більш сприйнятливі, ніж більшість людей з вашими п'ятьма відчуттями." 
		},
		'2' : {
			'Si' : "Ви суб'єктивно фільтруєте нову інформацію через свої попередні знання та досвід.",
			'Se' : "Ви бачите об'єктивно те, що знаходиться в навколишньому світі, без судження, без особистої упередженості і не бачите ніякого прихованого значення." 
		},
		'3' : {
			'Si' : "Ви любите пам'ятати і зберігати минуле, і ви віддаєте перевагу тому, що є досвідченим і істинним. Те, що ви берете, є рутинним і знайомим, і нові речі можуть зайняти час, щоб порадувати вас.",
			'Se' : 'Ви дотримуєтеся конкретних речей, які відбуваються навколо вас: Зображення, запахи, стилі, тенденції і те, що роблять люди навколо вас.' 
		},
		'4' : {
			'Si' : 'Ви дуже уважні до своїх внутрішніх тілесних відчуттів, таких як біль, голод і спрага.',
			'Se' : 'Ви любите фізичну красу і нові відчуття. Ви, можливо, захопливі, гуру моди або рятівник.' 
		},
		'5' : {
			'Si' : 'Ви засвоєте нову інформацію і ретельно порівнюєте її з вашою минулої поведінкою і досвідом, одночасно звертаючи увагу на вашу рутину.',
			'Se' : 'Для того, щоб змусити вас діяти, вам часто потрібен поштовх із зовнішнього світу.' 
		},
		'6' : {
			'Si' : 'Ви спостерігаєте.',
			'Se' : 'Ти реагиєш.' 
		},
		'7' : {
			'Si' : 'Ви вчитеся від своїх минулих помилок',
			'Se' : 'Ти, як правило, забуваєш удари минулого.' 
		},
		'8' : {
			'Si' : 'Ты думаешь, прежде чем действовать.',
			'Se' : 'Ты действовал прежде чем думаешь.' 
		},
		'9' : {
			'Si' : 'Ви хочете довгострокового задоволення.',
			'Se' : 'Ви волієте жити задоволено в короткостроковій перспективі. Карпе Дим.' 
		},
		'10' : {
			'Si' : 'Ви схильні бути більш помірними людьми, що дозволяє підтримувати стабільний спосіб життя протягом тривалого часу. Ви, як правило, обережні зі своїми грошима, хоча, наприклад, можете насолоджуватися покупками.',
			'Se' : 'Ти хочеш побалувати себе і діяти імпульсивно. Можна знайти важко сказати "НІ" собі, коли хочеш щось, або позбавити себе фізичної стимуляції або задоволення, так як життя повинно бути доживає до повного в кожен момент. Очевидно, що якщо ви старієте або більш зрілі, ви більш помірковані.' 
		},
	},
	'N' : {
		'1' : {
			'Ni' : 'Ви зосереджуєтеся на декількох хороших ідеях і виключаєте інших, щоб не відволікатися.',
			'Ne' : 'Ви не визначилися. Ви любите мозковий штурм і жонглювання багатьох думок відразу у вашому розумі.' 
		},
		'2' : {
			'Ni' : 'Ви зосереджуєтеся на своїх цілях або мріях і шукаєте ідеї, щоб зробити ваше майбутнє реальністю.',
			'Ne' : "Ви поглинаєте нові факти з зовнішнього світу і з'єднуєте точки в уявних способах для створення нових ідей." 
		},
		'3' : {
			'Ni' : 'Замість цього, здається, що ваш мозок робить лікування несвідомо, і ви, як правило, раптово досягають спускових моментів, які змушують вас діяти.',
			'Ne' : "Ваш світ - це вибух ідей, ви свідомо деконструюють речі в їх складові елементи, ви бачите сенс ідей за словами, і ви робите зв'язки, які інші не мають." 
		},
		'4' : {
			'Ni' : "Ви заглиблюєтеся в менше тем і об'єднуєте частини інформації, щоб створити єдину, когерентну ідею.",
			'Ne' : 'Ви маєте різноманітні захоплення і насолоджуєтеся стрибками вперед і назад. Ви зосереджуєтеся на вивченні можливостей.' 
		},
		'5' : {
			'Ni' : 'Ви любите робити вибір, щоб ви могли потрапити на роботу. Ви бачите ситуації з багатьох кутів і звертаєте увагу на вплив на ваш внутрішній світ.',
			'Ne' : 'Ви відкриті. Ти ненавидиш ситуації, які не мають захоплюючого психічного натхнення.' 
		},
		'6' : {
			'Ni' : 'Ти тримаєш свої думки перед собою.',
			'Ne' : 'Ти любиш ділитися своїми думками, своєю уявою.' 
		},
		'7' : {
			'Ni' : 'Ти багато знаєш про дуже мало.',
			'Ne' : 'Ви знаєте трохи про багато речей.' 
		},
		'8' : {
			'Ni' : 'Ви, як правило, зробили природний висновок, або бачите тільки одну можливість. Ви, по суті, підскакуєте до висновку, або ж дуже конкретно інтерпретаєте інформацію навколо себе.',
			'Ne' : 'У вас є ідеї, які є мозком. Ви люди "що, якщо...". Ви бачите світ у всіх його можливостях, що тоді означає, що у вас може виникнути труднощі вибору одного, що призводить до стану неприйняття або неможливості повністю займатися чимось.' 
		},
		'9' : {
			'Ni' : 'Тобі подобається, що таке концерт. Абстракція - це не те, що вам подобається.',
			'Ne' : 'Тобі подобається інтелектуальна абстракція.' 
		},
		'10' : {
			'Ni' : 'Ви, як правило, зосереджуєтеся на одній речі. Ви тільки захочете поділитися тим, що є абсолютно актуальним. Ми можемо легко слідувати вашим міркуваннями',
			'Ne' : 'Розмови з вами можуть швидко розтікатися. Ви, як правило, охопляєте широкий спектр тем за короткий проміжок часу. Ви перестрибуєте між предметами, які можуть здаватися дивними або еклектичними, але які повинні бути трекними.' 
		},
	}
}